import pandas as pd
import pytest


@pytest.fixture
def get_operations_df():
    df = pd.DataFrame({'Дата операции': ['31.12.2021 16:42:04', '07.04.2020 19:41:58'],
                       'Дата платежа': ['31.12.2021', '07.04.2020'],
                       'Номер карты': ['*7197', '*7197'],
                       'Статус': ['OK', 'OK'],
                       'Сумма операции': [-64.00, -100.00],
                       'Валюта операции': ['RUB', 'RUB'],
                       'Сумма платежа': [-64.00, -100.00],
                       'Валюта платежа': ['RUB', 'RUB'],
                       'Кэшбэк': [0, 0],
                       'Категория': ['Супермаркеты', 'Фастфуд'],
                       'MCC': ['5411', '5814'],
                       'Описание': ['Колхоз', 'IP Yakubovskaya M. V.'],
                       'Бонусы (включая кэшбэк)': [1.00, 2.00],
                       'Округление на инвесткопилку': [0.00, 0.00],
                       'Сумма операции с округлением': [64.00, 100.00]})
    return df
